{
  "items": [
    {
      "title": "Stream.Truthcasting",
      "description": "A front-facing video player for the Truthcasting Livestreaming platform, which provides a place where people can visit to view christ-centered content and livestreams created by various ministries and churches.  My responsibilities were focused on leading the effort on designing and implementing the user interface and experience, including each animations and most of the functionality.",
      "image": "img/truthcastingstream.png",
      "publishedLink": "https://www.stream.truthcasting.com",
      "technologies": [
        {
          "name": "SCSS"
        },
        {
          "name": "Azure"
        },
        {
          "name": "NextJS"
        }
      ],
      "published:ink": "https://stream.truthcasting.com"
    },
    {
      "description": "A website I voluntarily developed for the GIA'S Hope non-profit foundation, featuring a clean, intuitive and responsive user experience that is easily manageable.  Developed using best practices within Next JS, the code efficient and scalable.",
      "published:ink": "https://giashope.org/",
      "technologies": [
        {
          "name": "Next JS"
        },
        {
          "name": "SCSS"
        },
        {
          "name": "Netlify CMS"
        }
      ],
      "image": "img/giashope.png",
      "title": "Gia's Hope"
    },
    {
      "title": "Hula Bowl",
      "description": "The Hula Bowl is a college football postseason all-star gameDuring my job at Saltshaker Systems, I was able to lead the full-stack development and design process for the Hula Bowl website, featuring registration for athletes, scout and medial; support for news articles, events and a voting system for the Hula Bowl hall of fame; as well as creating the ability to manage the dynamic aspects of the website through a central admin panel created.",
      "published:ink": "https://hulabowl.com/",
      "image": "img/hulabowl.png",
      "technologies": [
        {
          "name": "Next JS"
        },
        {
          "name": "Strapi"
        },
        {
          "name": "Next UI"
        },
        {
          "name": "Node JS"
        }
      ]
    },
    {
      "title": "Kyxa Websockets API",
      "description": "Kyxa is a unique online multiplayer game that I helped to develop in collaboration with a friend.  My main responsibility was focused on creating a complete Websocket API server to establish real-time multiplayer communication, as well as designing and developing multiple algorithms to manipulate data structures in serving WebSocket requests.",
      "technologies": [
        {
          "name": "MySQL"
        },
        {
          "name": "Node JS"
        },
        {
          "name": "Websockets"
        }
      ],
      "published:ink": "https://www.programmersports.com/",
      "image": "img/kyxa.png"
    }
  ]
}