{
  "videos": [
    {
      "youtubeCode": "vK6lUw-j6vA",
      "title": "Streets of India and COI",
      "date": "September 2024",
      "location": "Delhi, India",
      "description": "T﻿hrough the partnership of Streets of India non-profit (located in Spain) and Cooperative Outreach of India, this education center was birthed to provide hope, light and opportunities to the children of India.  I was given the opportunity to create and speak in this video, sharing the impact this project from Streets of India has had on this community, with a call to action on how more support can help deepen the impact of this project and reach more children."
    },
    {
      "description": "L﻿ighthouse Delhi is an ongoing project to build a facility to train and equip pastors and spiritual leaders of the next generation, right in the heart of India.  I had the blessing of capturing this vision during my time serving with the Reach South Asia ministry in India.",
      "youtubeCode": "E4wmAvaJOoE",
      "date": "September, 2024",
      "location": "Delhi, India",
      "title": "The Vision of Lighthouse Delhi"
    },
    {
      "isPlaylist": true,
      "title": "Love Initiative",
      "description": "D﻿uring my time serving in India, I had the blessing of being part of the Love initiative, a regular, open mic event open for anyone in the area to join, which has a mission to grow relationships and strengthen community with the people in these cities, ultimately creating a open door to share the gospel. My main focus was to recap these event through videography, from flyer distribution to performances and lastly the biblical message",
      "youtubeCode": "PLIvX4rFVOjeo2SdAi6B9pqGw80bofZNwB",
      "date": "July - October 2024",
      "location": "India"
    },
    {
      "isPlaylist": false,
      "title": "House of Hope",
      "description": "Located in Guatemala, House of Hope is an orphanage for young children that was started in the honor of Hope Mackenzie Herman, and now is a thriving ministry making a difference in the lives of  many children.  I had the blessing of serving with this ministry during my time in Guatemala, and one of the ways I could serve this ministry was sharing the story of House of Hope through this documentary.",
      "youtubeCode": "nWHuiGDDEaw",
      "date": "April, 2024",
      "location": "San Lucas, Guatemala"
    },
    {
      "isPlaylist": false,
      "title": "The LÜM Project",
      "youtubeCode": "7ldDh8BK7iM",
      "description": "The LÜM Project is a mission to come alongside impoverished and exploited women in the villages of Guatemala, to make an impact to provides dignity, courage, empowerment and hope for the women, through providing them opportunities to use their talents of weaving as a way to generate income for their families. The LÜM Project opens the door to walk with these women spiritually, impacting generations for eternity.  While serving in Guatemala, I had the blessing of capturing this beautiful mission through the perspective of the women who have been impacted.",
      "date": "April, 2024",
      "location": "Guatemala"
    }
  ]
}