{
  "items": [
    {
      "title": "Board Member, Web Developer, and Tech Consultant",
      "position": "Gia's Hope Foundation",
      "timeFrame": "2018 - Present",
      "isPresent": true,
      "points": [
        {
          "content": "Designed, developed, and deployed a professional, user-friendly website for GIA's Hope using Next.js, providing visitors with an impactful platform to learn about the foundation, apply for adoption grants, and receive ministry updates."
        },
        {
          "content": "Act as a tech consultant, providing strategic guidance on the foundation's technological needs and overseeing the selection and approval of services and tools."
        }
      ]
    },
    {
      "title": "Documentary Filmmaker and Media Producer Intern",
      "position": "Cooperative Outreach of India",
      "timeFrame": "Jun 2024 - Oct 2024",
      "isPresent": false,
      "points": [
        {
          "content": "Independently directed, produced, and edited documentary films to showcase the transformative impact of ministry efforts, which significantly increased support and awareness, contributing to heightened engagement and financial backing for initiatives like the Genesis of Hope education centers and the Give Water Project."
        },
        {
          "content": "Collaborated with a team of media professionals for the Love Initiative in New Delhi and Jaipur, independently producing and editing video content and conducting street interviews to promote open mic events focused on relationship-building and gospel outreach."
        }
      ]
    },
    {
      "title": "Computer Teacher",
      "position": "Club La Esperanza Nicaragua",
      "timeFrame": "Oct 2022 - May 2023",
      "isPresent": false,
      "points": [
        {
          "content": "Launched a computer literacy program for Spanish-speaking students (ages 11-12) at a local school in Managua, Nicaragua."
        },
        {
          "content": "Designed and taught an introductory computer course in Spanish, helping students develop foundational digital skills, navigate user interfaces, and use key applications for practical purposes."
        },
        {
          "content": "Provided mentorship and spiritual guidance, fostering a positive, faith-based environment by engaging with students through prayer, play, and gospel-centered discussions, bringing hope to a challenging community."
        }
      ]
    }
  ]
}
